Revit 2027 API
FamilyInstanceCreationData(Face, Line, FamilySymbol) Constructor
Initializes a new instance of the FamilyInstanceCreationData class
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData(
	Face face,
	Line position,
	FamilySymbol symbol
)
Public Sub New (
	face As Face,
	position As Line,
	symbol As FamilySymbol
)
public:
FamilyInstanceCreationData(
	Face^ face,
	Line^ position,
	FamilySymbol^ symbol
)
new :
        face : Face *
        position : Line *
        symbol : FamilySymbol -> FamilyInstanceCreationData
Parameters
face Face
A face of a geometry object.
position Line
A line on the face defining where the symbol is to be placed.
symbol FamilySymbol
A FamilySymbol object that represents the type of the instance that is to be inserted.
See Also
Reference
FamilyInstanceCreationData Class
FamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace